tutorials/PFB_3D_Resolved_LES/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// 使用 codeStream 自动生成 patches 列表
patches
#codeStream
{
    code
    #{
        os << "(" << endl;

        // --- 循环参数 (与 topoSet 保持一致) ---
        int nx = 17; // X方向数量
        int nz = 6;  // Z方向数量

        for (int j = 1; j <= nz; ++j)
        {
            for (int i = 1; i <= nx; ++i)
            {
                // 构造名称，例如 x1_z1
                // 这里的 name 是新建的 patch 名字
                // 这里的 set  是上一步 topoSet 生成的 faceSet 名字
                
                os  << "    { "
                    << "name x" << i << "_z" << j << "; "
                    << "set x" << i << "_z" << j << "; "
                    << "constructFrom set; "
                    << "patchInfo { type wall; } "
                    << "}" << endl;
            }
        }

        os << ");" << endl;
    #};
};

// ************************************************************************* //
