tutorials/PFB_3D_Resolved_LES/0.orig/porosityIndex
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityIndex;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(front|back)"
    {
        type            zeroGradient;//cyclicAMI;
    }

    "(floater|x.*_z.*|inlet|outlet|stationaryWalls|atmosphere)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
